---
kind: method
id: M:Autodesk.Revit.DB.PolyLine.GetOutline
zh: 多段线、折线
source: html/96b8be9a-67ae-823c-53aa-0afadb017a7b.htm
---
# Autodesk.Revit.DB.PolyLine.GetOutline Method

**中文**: 多段线、折线

Gets the outline of the polyline.

## Syntax (C#)
```csharp
public Outline GetOutline()
```